Locked-Inc/STAR/star-esp32-firmware/lib/star_bus/src/star_bus_manager.c
/**
 * @file star_bus_manager.c
 * @brief Unified bus manager implementation for multi-protocol peripheral management
 * @details
 * Implements the central bus management system for I2C, SPI, UART, GPIO, ADC, and 1-Wire
 * protocols. Provides thread-safe bus registration, lookup, and lifecycle management with
 * a linked-list registry. Supports dependency injection of error handlers and pin validators
 * following the Dependency Inversion Principle for loose coupling and testability.
 *
 * @date 2025-12-19
 * @copyright Copyright (c) 2025 STAR Project
 */

#include "star_bus_manager.h"

#include "freertos/FreeRTOS.h"
#include "freertos/semphr.h"

#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include "esp_check.h"
#include "esp_log.h"
#include "sdkconfig.h" /* For Kconfig values like timeout */
#include "soc/soc_caps.h"
#include "star_bus_adc.h"
#include "star_bus_config.h"
#include "star_bus_gpio.h"

/* --- Constants --- */

static const char* s_tag = "STAR_BUS_MANAGER";

/* --- Pin Registration Helpers --- */

/**
 * @brief Helper to register a single pin via the interface
 */
static esp_err_t internal_register_bus_pin(star_pin_interface_t* pin_iface,
                                           gpio_num_t            pin,
                                           const char*           bus_name,
                                           const char*           usage,
                                           bool                  can_be_shared)
{
  if (pin < 0 || pin >= GPIO_NUM_MAX) {
    return ESP_OK; /* Not an error, pin is not used */
  }

  if (!pin_iface || !pin_iface->register_pin) {
    return ESP_OK; /* No interface, skip registration */
  }

  /* Create description: "BusName: Usage" (e.g., "I2C0: SDA") */
  char desc[64];
  snprintf(desc, sizeof(desc), "%s: %s", bus_name, usage);

  return pin_iface->register_pin(pin_iface->ctx, pin, desc, can_be_shared);
}

/**
 * @brief Helper to unregister a single pin via the interface
 */
static esp_err_t internal_unregister_bus_pin(star_pin_interface_t* pin_iface,
                                             gpio_num_t            pin,
                                             const char*           bus_name,
                                             const char*           usage)
{
  if (pin < 0 || pin >= GPIO_NUM_MAX) {
    return ESP_OK; /* Not an error, pin was not used */
  }

  if (!pin_iface || !pin_iface->unregister_pin) {
    return ESP_OK; /* No interface, skip unregistration */
  }

  /* Create same description format as registration */
  char desc[64];
  snprintf(desc, sizeof(desc), "%s: %s", bus_name, usage);

  return pin_iface->unregister_pin(pin_iface->ctx, pin, desc);
}

/**
 * @brief Register all pins for a single bus configuration
 */
static esp_err_t internal_register_config_pins(star_pin_interface_t*    pin_iface,
                                               const star_bus_config_t* config)
{
  if (!config || !config->name) {
    return ESP_ERR_INVALID_ARG;
  }

  esp_err_t ret         = ESP_OK;
  esp_err_t first_error = ESP_OK;

  switch (config->type) {
    case k_star_bus_type_i2c:
      ret = internal_register_bus_pin(pin_iface,
                                      config->proto.i2c.config.sda_io_num,
                                      config->name,
                                      "I2C SDA",
                                      true); /* I2C pins can be shared */
      if (ret != ESP_OK && first_error == ESP_OK) {
        first_error = ret;
      }

      ret = internal_register_bus_pin(pin_iface,
                                      config->proto.i2c.config.scl_io_num,
                                      config->name,
                                      "I2C SCL",
                                      true); /* I2C pins can be shared */
      if (ret != ESP_OK && first_error == ESP_OK) {
        first_error = ret;
      }
      break;

    case k_star_bus_type_spi:
      /* SPI bus pins (shared across devices on same host) */
      ret = internal_register_bus_pin(pin_iface,
                                      config->proto.spi.copi_io_num,
                                      config->name,
                                      "SPI COPI",
                                      true);
      if (ret != ESP_OK && first_error == ESP_OK) {
        first_error = ret;
      }

      ret = internal_register_bus_pin(pin_iface,
                                      config->proto.spi.cipo_io_num,
                                      config->name,
                                      "SPI CIPO",
                                      true);
      if (ret != ESP_OK && first_error == ESP_OK) {
        first_error = ret;
      }

      ret = internal_register_bus_pin(pin_iface,
                                      config->proto.spi.sclk_io_num,
                                      config->name,
                                      "SPI SCLK",
                                      true);
      if (ret != ESP_OK && first_error == ESP_OK)
        first_error = ret;

      /* SPI CS pin is device-specific and NOT shared */
      ret = internal_register_bus_pin(pin_iface,
                                      config->proto.spi.dev_cfg.spics_io_num,
                                      config->name,
                                      "SPI CS",
                                      false); /* CS is not shareable */
      if (ret != ESP_OK && first_error == ESP_OK)
        first_error = ret;
      break;

    default:
      ESP_LOGD(s_tag, "No pin registration for bus type: %d", config->type);
      break;
  }

  return first_error;
}

/**
 * @brief Unregister all pins for a single bus configuration
 */
static esp_err_t internal_unregister_config_pins(star_pin_interface_t*    pin_iface,
                                                 const star_bus_config_t* config)
{
  if (!config || !config->name) {
    return ESP_ERR_INVALID_ARG;
  }

  esp_err_t ret         = ESP_OK;
  esp_err_t first_error = ESP_OK;

  switch (config->type) {
    case k_star_bus_type_i2c:
      ret = internal_unregister_bus_pin(pin_iface,
                                        config->proto.i2c.config.sda_io_num,
                                        config->name,
                                        "I2C SDA");
      if (ret != ESP_OK && first_error == ESP_OK)
        first_error = ret;

      ret = internal_unregister_bus_pin(pin_iface,
                                        config->proto.i2c.config.scl_io_num,
                                        config->name,
                                        "I2C SCL");
      if (ret != ESP_OK && first_error == ESP_OK)
        first_error = ret;
      break;

    case k_star_bus_type_spi:
      ret = internal_unregister_bus_pin(pin_iface,
                                        config->proto.spi.copi_io_num,
                                        config->name,
                                        "SPI COPI");
      if (ret != ESP_OK && first_error == ESP_OK)
        first_error = ret;

      ret = internal_unregister_bus_pin(pin_iface,
                                        config->proto.spi.cipo_io_num,
                                        config->name,
                                        "SPI CIPO");
      if (ret != ESP_OK && first_error == ESP_OK)
        first_error = ret;

      ret = internal_unregister_bus_pin(pin_iface,
                                        config->proto.spi.sclk_io_num,
                                        config->name,
                                        "SPI SCLK");
      if (ret != ESP_OK && first_error == ESP_OK)
        first_error = ret;

      ret = internal_unregister_bus_pin(pin_iface,
                                        config->proto.spi.dev_cfg.spics_io_num,
                                        config->name,
                                        "SPI CS");
      if (ret != ESP_OK && first_error == ESP_OK)
        first_error = ret;
      break;

    default:
      ESP_LOGD(s_tag, "No pin unregistration for bus type: %d", config->type);
      break;
  }

  return first_error;
}

/* --- Public Functions --- */

esp_err_t star_bus_manager_init(star_bus_manager_t*     manager,
                                const char*             tag,
                                star_error_interface_t* error_iface,
                                star_pin_interface_t*   pin_iface)
{
  ESP_RETURN_ON_FALSE(manager, ESP_ERR_INVALID_ARG, s_tag, "Manager pointer is NULL");

  manager->buses       = NULL;
  manager->error_iface = error_iface; /* Can be NULL */
  manager->pin_iface   = pin_iface;   /* Can be NULL */

