Locked-Inc/STAR/star-esp32-firmware/lib/star_bus/src/star_bus_manager.c
  /* Set logging tag */
  if (tag && strlen(tag) > 0) {
    /* Use strdup for safety, requires free later */
    /* Cast needed because manager->tag is const char* but strdup returns char* */
    manager->tag = strdup(tag);
    ESP_RETURN_ON_FALSE(manager->tag,
                        ESP_ERR_NO_MEM,
                        s_tag,
                        "Failed to allocate memory for manager tag");
  } else {
    manager->tag = s_tag; /* Use the component's default static tag */
  }

  manager->mutex = xSemaphoreCreateMutex();
  if (!manager->mutex) {
    ESP_LOGE(manager->tag, "Failed to create mutex");
    /* Free tag only if it was dynamically allocated */
    if (manager->tag != s_tag) {
      free((void*)manager->tag); /* Cast needed for free */
      manager->tag = NULL;
    }
    return ESP_ERR_NO_MEM;
  }

  /* Initialize SPI host tracking */
  for (uint32_t i = 0; i < SPI_HOST_MAX; ++i) {
    manager->spi_host_initialized[i] = false;
    manager->spi_device_count[i]     = 0; /* Initialize device count */
  }

  /* Initialize ADC unit tracking */
  for (uint32_t i = 0; i < SOC_ADC_PERIPH_NUM; ++i) {
    manager->adc_unit_handles[i]  = NULL;
    manager->adc_channel_count[i] = 0;
  }

  ESP_LOGI(manager->tag, "Initialized");
  return ESP_OK;
}

esp_err_t star_bus_manager_add_bus(star_bus_manager_t* manager, star_bus_config_t* config)
{
  ESP_RETURN_ON_FALSE(manager && config,
                      ESP_ERR_INVALID_ARG,
                      s_tag,
                      "Manager or config pointer is NULL");
  ESP_RETURN_ON_FALSE(config->name && strlen(config->name) > 0,
                      ESP_ERR_INVALID_ARG,
                      manager->tag,
                      "Config name is NULL or empty");
  ESP_RETURN_ON_FALSE(config->type > k_star_bus_type_none && config->type < k_star_bus_type_count,
                      ESP_ERR_INVALID_ARG,
                      manager->tag,
                      "Invalid bus type in config");
  ESP_RETURN_ON_FALSE(manager->mutex,
                      ESP_ERR_INVALID_STATE,
                      manager->tag,
                      "Manager mutex not initialized");

  esp_err_t ret = ESP_OK;

  if (xSemaphoreTake(manager->mutex, pdMS_TO_TICKS(CONFIG_STAR_KCONFIG_BUS_MUTEX_TIMEOUT_MS)) !=
      pdTRUE) {
    ESP_LOGE(manager->tag, "Timeout acquiring mutex for adding bus '%s'", config->name);
    return ESP_ERR_TIMEOUT;
  }

  /* Check for duplicate name */
  for (star_bus_config_t* curr = manager->buses; curr; curr = curr->next) {
    if (curr->name && strcmp(curr->name, config->name) == 0) {
      ESP_LOGE(manager->tag, "Bus with name '%s' already exists", config->name);
      ret = ESP_ERR_INVALID_STATE;
      goto add_give_mutex; /* Use goto for single exit point with mutex give */
    }
  }

  /* Initialize the bus hardware *before* adding it to the list */
  /* This ensures the manager's SPI host tracking is updated correctly */
  if (!config->initialized) {
    /* Pass the manager to init for SPI host tracking */
    ret = star_bus_config_init(config, manager);
    if (ret != ESP_OK) {
      ESP_LOGE(manager->tag,
               "Failed to initialize bus hardware for '%s': %s",
               config->name,
               esp_err_to_name(ret));
      /* Record the error for tracking and potential recovery */
      if (manager->error_iface && manager->error_iface->record_error) {
        manager->error_iface->record_error(manager->error_iface->ctx,
                                           ret,
                                           "Bus hardware initialization failed during add_bus",
                                           __FILE__,
                                           __LINE__,
                                           __func__);
      }
      goto add_give_mutex; /* Don't add if init failed */
    }
  }

  /* Add to head of list */
  config->next   = manager->buses;
  manager->buses = config;

  ESP_LOGI(manager->tag,
           "Added bus config: %s (Type: %s)",
           config->name,
           star_bus_type_to_string(config->type));

  /* Register pins with pin validator */
  esp_err_t pin_reg_ret = internal_register_config_pins(manager->pin_iface, config);
  if (pin_reg_ret != ESP_OK) {
    ESP_LOGW(manager->tag,
             "Failed to register pins for bus '%s': %s (bus still added)",
             config->name,
             esp_err_to_name(pin_reg_ret));
    /* Don't fail the add operation, just warn - bus is still functional */
  } else {
    ESP_LOGD(manager->tag, "Pins registered for bus '%s'", config->name);
  }

add_give_mutex:
  xSemaphoreGive(manager->mutex);
  return ret;
}

star_bus_config_t* star_bus_manager_find_bus(const star_bus_manager_t* manager, const char* name)
{
  /* Allow NULL manager or name, just return NULL without logging error */
  if (!manager || !name || strlen(name) == 0 || !manager->mutex) {
    return NULL;
  }

  star_bus_config_t* found_bus = NULL;

  if (xSemaphoreTake(manager->mutex, pdMS_TO_TICKS(CONFIG_STAR_KCONFIG_BUS_MUTEX_TIMEOUT_MS)) !=
      pdTRUE) {
    ESP_LOGE(manager->tag, "Timeout acquiring mutex for finding bus '%s'", name);
    return NULL; /* Return NULL on timeout */
  }

  for (star_bus_config_t* curr = manager->buses; curr; curr = curr->next) {
    if (curr->name && strcmp(curr->name, name) == 0) {
      found_bus = curr;
      break;
    }
  }

  xSemaphoreGive(manager->mutex);
  return found_bus;
}

esp_err_t star_bus_manager_with_bus(star_bus_manager_t* manager,
                                    const char*         name,
                                    star_bus_callback_t callback,
                                    void*               user_ctx)
{
  ESP_RETURN_ON_FALSE(manager && name && strlen(name) > 0 && callback,
                      ESP_ERR_INVALID_ARG,
                      s_tag,
                      "Invalid arguments to with_bus");
  ESP_RETURN_ON_FALSE(manager->mutex,
                      ESP_ERR_INVALID_STATE,
                      manager->tag,
                      "Manager mutex not initialized");

  if (xSemaphoreTake(manager->mutex, pdMS_TO_TICKS(CONFIG_STAR_KCONFIG_BUS_MUTEX_TIMEOUT_MS)) !=
      pdTRUE) {
    ESP_LOGE(manager->tag, "Timeout acquiring mutex for with_bus '%s'", name);
    return ESP_ERR_TIMEOUT;
  }

  /* Find the bus while holding mutex */
  star_bus_config_t* found_bus = NULL;
  for (star_bus_config_t* curr = manager->buses; curr; curr = curr->next) {
    if (curr->name && strcmp(curr->name, name) == 0) {
      found_bus = curr;
      break;
    }
  }

