Locked-Inc/STAR/star-esp32-firmware/lib/star_bus/src/star_bus_manager.c
  if (found_bus == NULL) {
    xSemaphoreGive(manager->mutex);
    return ESP_ERR_NOT_FOUND;
  }

  /* Invoke callback while still holding mutex - this prevents use-after-free */
  esp_err_t callback_result = callback(found_bus, user_ctx);

  xSemaphoreGive(manager->mutex);
  return callback_result;
}

esp_err_t star_bus_manager_remove_bus(star_bus_manager_t* manager, const char* name)
{
  ESP_RETURN_ON_FALSE(manager && name && strlen(name) > 0,
                      ESP_ERR_INVALID_ARG,
                      s_tag,
                      "Manager is NULL or name is invalid");
  ESP_RETURN_ON_FALSE(manager->mutex,
                      ESP_ERR_INVALID_STATE,
                      manager->tag,
                      "Manager mutex not initialized");

  star_bus_config_t* to_remove         = NULL;
  star_bus_config_t* prev              = NULL;
  esp_err_t          ret               = ESP_ERR_NOT_FOUND;
  spi_host_device_t  spi_host_to_check = -1;
  bool               free_spi_bus      = false;
  adc_unit_t         adc_unit_to_check = -1;
  bool               free_adc_unit     = false;

  /* Take mutex for the entire critical section to prevent race conditions */
  if (xSemaphoreTake(manager->mutex, pdMS_TO_TICKS(CONFIG_STAR_KCONFIG_BUS_MUTEX_TIMEOUT_MS * 2)) !=
      pdTRUE) {
    ESP_LOGE(manager->tag, "Timeout acquiring mutex for removing bus '%s'", name);
    return ESP_ERR_TIMEOUT;
  }

  /* Find and unlink the bus config */
  for (star_bus_config_t* curr = manager->buses; curr; prev = curr, curr = curr->next) {
    if (curr->name && strcmp(curr->name, name) == 0) {
      to_remove = curr;
      if (prev == NULL) {
        manager->buses = curr->next;
      } else {
        prev->next = curr->next;
      }
      to_remove->next = NULL;
      ret             = ESP_OK;

      /* Handle SPI device count and determine if bus should be freed */
      if (to_remove->type == k_star_bus_type_spi) {
        spi_host_to_check = to_remove->proto.spi.host;
        if (spi_host_to_check >= 0 && spi_host_to_check < SPI_HOST_MAX) {
          if (manager->spi_device_count[spi_host_to_check] > 0) {
            manager->spi_device_count[spi_host_to_check]--;
            ESP_LOGD(manager->tag,
                     "Decremented device count for SPI host %d to %d",
                     spi_host_to_check,
                     manager->spi_device_count[spi_host_to_check]);
          } else {
            ESP_LOGW(manager->tag,
                     "SPI device count for host %d was already 0!",
                     spi_host_to_check);
          }

          /* Determine if we should free the SPI bus - do this while holding mutex */
          if (manager->spi_device_count[spi_host_to_check] == 0 &&
              manager->spi_host_initialized[spi_host_to_check]) {
            free_spi_bus = true;
            /* Pre-emptively mark as uninitialized to prevent new devices from using it */
            manager->spi_host_initialized[spi_host_to_check] = false;
          }
        } else {
          ESP_LOGE(manager->tag,
                   "Invalid SPI host %d found in config '%s'",
                   spi_host_to_check,
                   name);
          spi_host_to_check = -1;
        }
      }

      /* Handle ADC channel count and determine if unit should be freed */
      if (to_remove->type == k_star_bus_type_adc) {
        adc_unit_to_check = to_remove->proto.adc.unit;
        if (adc_unit_to_check >= 0 && adc_unit_to_check < SOC_ADC_PERIPH_NUM) {
          if (manager->adc_channel_count[adc_unit_to_check] > 0) {
            manager->adc_channel_count[adc_unit_to_check]--;
            ESP_LOGD(manager->tag,
                     "Decremented channel count for ADC unit %d to %d",
                     adc_unit_to_check,
                     manager->adc_channel_count[adc_unit_to_check]);
          } else {
            ESP_LOGW(manager->tag,
                     "ADC channel count for unit %d was already 0!",
                     adc_unit_to_check);
          }

          /* Determine if we should free the ADC unit - do this while holding mutex */
          if (manager->adc_channel_count[adc_unit_to_check] == 0 &&
              manager->adc_unit_handles[adc_unit_to_check] != NULL) {
            free_adc_unit = true;
          }
        } else {
          ESP_LOGE(manager->tag,
                   "Invalid ADC unit %d found in config '%s'",
                   adc_unit_to_check,
                   name);
          adc_unit_to_check = -1;
        }
      }
      break;
    }
  }

  if (ret == ESP_ERR_NOT_FOUND) {
    xSemaphoreGive(manager->mutex);
    ESP_LOGW(manager->tag, "Bus '%s' not found for removal", name);
    return ESP_ERR_NOT_FOUND;
  }

  /* Unregister pins while still holding mutex */
  esp_err_t pin_unreg_ret = internal_unregister_config_pins(manager->pin_iface, to_remove);
  if (pin_unreg_ret != ESP_OK) {
    ESP_LOGW(manager->tag,
             "Failed to unregister pins for bus '%s': %s",
             name,
             esp_err_to_name(pin_unreg_ret));
  }

  /* Destroy the config (calls deinit internally) while holding mutex */
  esp_err_t destroy_result = star_bus_config_destroy(to_remove);
  if (destroy_result != ESP_OK) {
    ESP_LOGE(manager->tag,
             "Error destroying bus config '%s': %s",
             name,
             esp_err_to_name(destroy_result));
    ret = destroy_result;
  } else {
    ESP_LOGI(manager->tag, "Removed and destroyed bus config: %s", name);
  }

  /* Free the underlying SPI bus if necessary - still holding mutex */
  if (free_spi_bus) {
    ESP_LOGI(manager->tag, "Freeing SPI bus driver for host %d...", spi_host_to_check);
    esp_err_t free_ret = spi_bus_free(spi_host_to_check);
    if (free_ret != ESP_OK) {
      ESP_LOGE(manager->tag,
               "Failed to free SPI bus for host %d: %s",
               spi_host_to_check,
               esp_err_to_name(free_ret));
      /* Restore initialized flag since free failed */
      manager->spi_host_initialized[spi_host_to_check] = true;
      if (ret == ESP_OK) {
        ret = free_ret;
      }
    } else {
      ESP_LOGI(manager->tag, "SPI bus driver for host %d freed.", spi_host_to_check);
    }
  }

  /* Free the ADC unit if necessary - still holding mutex */
  if (free_adc_unit) {
    ESP_LOGI(manager->tag, "Freeing ADC unit %d...", adc_unit_to_check);
    esp_err_t free_ret = adc_oneshot_del_unit(manager->adc_unit_handles[adc_unit_to_check]);
    if (free_ret != ESP_OK) {
      ESP_LOGE(manager->tag,
               "Failed to free ADC unit %d: %s",
               adc_unit_to_check,
               esp_err_to_name(free_ret));
      if (ret == ESP_OK) {
        ret = free_ret;
      }
    } else {
      manager->adc_unit_handles[adc_unit_to_check] = NULL;
      ESP_LOGI(manager->tag, "ADC unit %d freed.", adc_unit_to_check);
    }
  }

  xSemaphoreGive(manager->mutex);
  return ret;
}

esp_err_t star_bus_manager_deinit(star_bus_manager_t* manager)
{
  ESP_RETURN_ON_FALSE(manager, ESP_ERR_INVALID_ARG, s_tag, "Manager pointer is NULL");

  bool mutex_taken = false;
  if (manager->mutex != NULL) {
    /* Use a slightly longer timeout for full cleanup */
    if (xSemaphoreTake(manager->mutex,
                       pdMS_TO_TICKS(CONFIG_STAR_KCONFIG_BUS_MUTEX_TIMEOUT_MS * 2)) == pdTRUE) {
      mutex_taken = true;
    } else {
      ESP_LOGE(manager->tag, "Timeout acquiring mutex for deinit - cleanup may be incomplete!");
      /* Continue cautiously without mutex */
    }
  } else {
    ESP_LOGW(manager->tag, "Manager mutex was NULL during deinit");
  }

