Locked-Inc/STAR/star-esp32-firmware/lib/star_bus/src/star_bus_manager.c
  /* Detach list head while holding mutex to prevent new operations */
  star_bus_config_t* curr = manager->buses;
  manager->buses          = NULL;

  /* Note: We keep the mutex held during cleanup to prevent race conditions.
   * This may block other operations, but deinit should not be called during
   * normal operation - only at shutdown. */

  esp_err_t first_error = ESP_OK;

  ESP_LOGI(manager->tag, "Deinitializing all managed buses...");
  while (curr) {
    star_bus_config_t* next  = curr->next; /* Store next pointer before destroying curr */
    const char* current_name = curr->name ? curr->name : "UNKNOWN"; /* Save name for logging */

    /* Unregister pins before destroying */
    esp_err_t pin_unreg_ret = internal_unregister_config_pins(manager->pin_iface, curr);
    if (pin_unreg_ret != ESP_OK) {
      ESP_LOGW(manager->tag,
               "Failed to unregister pins for bus '%s' during deinit: %s",
               current_name,
               esp_err_to_name(pin_unreg_ret));
    }

    /* Destroy calls deinit internally */
    esp_err_t destroy_result = star_bus_config_destroy(curr); /* curr is valid here */
    if (destroy_result != ESP_OK) {
      ESP_LOGE(manager->tag,
               "Error destroying bus '%s' during manager deinit: %s",
               current_name,
               esp_err_to_name(destroy_result));
      if (first_error == ESP_OK) {
        first_error = destroy_result; /* Record the first error encountered */
      }
    }
    curr = next; /* Move to the next node (original curr pointer is now invalid) */
  }

  /* Free underlying SPI buses that might still be marked as initialized */
  for (uint32_t host = 0; host < SPI_HOST_MAX; ++host) {
    if (manager->spi_host_initialized[host]) {
      ESP_LOGI(manager->tag, "Freeing potentially orphaned SPI bus driver for host %d...", host);
      esp_err_t free_ret = spi_bus_free((spi_host_device_t)host);
      if (free_ret != ESP_OK) {
        ESP_LOGE(manager->tag,
                 "Failed to free SPI bus for host %d during manager deinit: %s",
                 host,
                 esp_err_to_name(free_ret));
        if (first_error == ESP_OK) {
          first_error = free_ret;
        }
      }
      manager->spi_host_initialized[host] = false;
      manager->spi_device_count[host]     = 0;
    }
  }

  /* Free the tag string if it was dynamically allocated */
  if (manager->tag != NULL && manager->tag != s_tag) {
    free((void*)manager->tag); /* Cast needed for free */
  }
  manager->tag = NULL;

  /* Clear interface pointers (we don't own them) */
  manager->error_iface = NULL;
  manager->pin_iface   = NULL;

  /* Release and delete mutex */
  if (manager->mutex != NULL) {
    if (mutex_taken) {
      xSemaphoreGive(manager->mutex);
    }
    vSemaphoreDelete(manager->mutex);
    manager->mutex = NULL;
  }

  ESP_LOGI(s_tag,
           "Manager deinitialized %s",
           (first_error == ESP_OK) ? "successfully" : "with errors");
  return first_error;
}

/* --- Pin Registration --- */

/* Helper function to register a single pin if valid */
static inline esp_err_t register_pin_if_valid(gpio_num_t                  pin,
                                              const char*                 bus_name,
                                              const char*                 usage,
                                              pin_registration_function_t reg_func,
                                              void*                       user_ctx,
                                              bool                        can_be_shared)
{
  if (pin >= 0 && pin < GPIO_NUM_MAX) /* Check if pin number is valid */
  {
    return reg_func(pin, bus_name, usage, user_ctx);
  }
  return ESP_OK; /* Not an error if pin is not used (-1) or invalid */
}

esp_err_t star_bus_manager_register_all_pins(const star_bus_manager_t*   manager,
                                             pin_registration_function_t reg_func,
                                             void*                       user_ctx)
{
  ESP_RETURN_ON_FALSE(manager && reg_func,
                      ESP_ERR_INVALID_ARG,
                      s_tag,
                      "Manager or registration function is NULL");
  ESP_RETURN_ON_FALSE(manager->mutex,
                      ESP_ERR_INVALID_STATE,
                      manager->tag,
                      "Manager mutex not initialized");

  esp_err_t ret        = ESP_OK;
  esp_err_t reg_result = ESP_OK; /* Track registration errors separately */

  if (xSemaphoreTake(manager->mutex, pdMS_TO_TICKS(CONFIG_STAR_KCONFIG_BUS_MUTEX_TIMEOUT_MS)) !=
      pdTRUE) {
    ESP_LOGE(manager->tag, "Timeout acquiring mutex for pin registration");
    return ESP_ERR_TIMEOUT;
  }

  ESP_LOGI(manager->tag, "Registering pins for all managed buses...");

  for (star_bus_config_t* curr = manager->buses; curr; curr = curr->next) {
    const char* bus_name = curr->name ? curr->name : "UNKNOWN";
    ESP_LOGD(manager->tag,
             "Processing pins for bus '%s' (Type: %s)",
             bus_name,
             star_bus_type_to_string(curr->type));

    switch (curr->type) {
      case k_star_bus_type_i2c:
        reg_result = register_pin_if_valid(curr->proto.i2c.config.sda_io_num,
                                           bus_name,
                                           "I2C SDA",
                                           reg_func,
                                           user_ctx,
                                           true); /* I2C pins are shareable */
        if (reg_result != ESP_OK && ret == ESP_OK)
          ret = reg_result;

        reg_result = register_pin_if_valid(curr->proto.i2c.config.scl_io_num,
                                           bus_name,
                                           "I2C SCL",
                                           reg_func,
                                           user_ctx,
                                           true); /* I2C pins are shareable */
        if (reg_result != ESP_OK && ret == ESP_OK)
          ret = reg_result;
        break;

      case k_star_bus_type_spi:
        /* SPI bus pins (COPI, CIPO, SCLK) are shared per host */
        /* Use the renamed internal fields for registration */
        reg_result = register_pin_if_valid(curr->proto.spi.copi_io_num,
                                           bus_name,
                                           "SPI COPI", /* Updated description */
                                           reg_func,
                                           user_ctx,
                                           true);
        if (reg_result != ESP_OK && ret == ESP_OK)
          ret = reg_result;

        reg_result = register_pin_if_valid(curr->proto.spi.cipo_io_num,
                                           bus_name,
                                           "SPI CIPO", /* Updated description */
                                           reg_func,
                                           user_ctx,
                                           true);
        if (reg_result != ESP_OK && ret == ESP_OK)
          ret = reg_result;

        reg_result = register_pin_if_valid(curr->proto.spi.sclk_io_num,
                                           bus_name,
                                           "SPI SCLK",
                                           reg_func,
                                           user_ctx,
                                           true);
        if (reg_result != ESP_OK && ret == ESP_OK)
          ret = reg_result;

