Locked-Inc/STAR/star-esp32-firmware/lib/star_bus/src/star_bus_manager.c
        /* SPI CS pin is device-specific and NOT shared */
        reg_result = register_pin_if_valid(curr->proto.spi.dev_cfg.spics_io_num,
                                           bus_name,
                                           "SPI CS",
                                           reg_func,
                                           user_ctx,
                                           false);
        if (reg_result != ESP_OK && ret == ESP_OK)
          ret = reg_result;

        /* Register DC pin if used (often specific to device, not shared) */
        /* Assuming DC pin info might be stored in user context or flags if needed */
        /* For now, we don't have DC pin explicitly in config, HAL registers it */
        break;

      default:
        ESP_LOGW(manager->tag,
                 "Skipping pin registration for unsupported bus type: %d",
                 curr->type);
        break;
    }

    /* Log first error encountered during registration for this bus */
    if (ret != ESP_OK && reg_result != ESP_OK) {
      ESP_LOGE(manager->tag,
               "Pin registration failed for bus '%s' (first error: %s)",
               bus_name,
               esp_err_to_name(ret));
    }
  }

  xSemaphoreGive(manager->mutex);

  if (ret != ESP_OK) {
    ESP_LOGE(manager->tag,
             "Pin registration process completed with errors (first error: %s)",
             esp_err_to_name(ret));
  } else {
    ESP_LOGI(manager->tag, "Pin registration process completed.");
  }

  /* Return the first error encountered during registration calls */
  return ret;
}

/* --- Unified Bus Interface --- */

esp_err_t star_bus_write_digital(star_bus_manager_t* manager,
                                 const char*         bus_name,
                                 uint8_t             pin_index,
                                 uint8_t             value)
{
  ESP_RETURN_ON_FALSE(manager && bus_name,
                      ESP_ERR_INVALID_ARG,
                      s_tag,
                      "Manager or bus_name is NULL");

  /* Dispatch to GPIO bus function */
  return star_bus_gpio_write_digital(manager, bus_name, pin_index, value);
}

esp_err_t star_bus_read_digital(star_bus_manager_t* manager,
                                const char*         bus_name,
                                uint8_t             pin_index,
                                uint8_t*            value)
{
  ESP_RETURN_ON_FALSE(manager && bus_name && value,
                      ESP_ERR_INVALID_ARG,
                      s_tag,
                      "Manager, bus_name, or value is NULL");

  /* Dispatch to GPIO bus function */
  return star_bus_gpio_read_digital(manager, bus_name, pin_index, value);
}

esp_err_t
star_bus_read_analog_raw(star_bus_manager_t* manager, const char* bus_name, int32_t* out_raw)
{
  ESP_RETURN_ON_FALSE(manager && bus_name && out_raw,
                      ESP_ERR_INVALID_ARG,
                      s_tag,
                      "Manager, bus_name, or out_raw is NULL");

  /* Dispatch to ADC bus function */
  return star_bus_adc_read_raw(manager, bus_name, out_raw);
}

esp_err_t
star_bus_read_analog_mv(star_bus_manager_t* manager, const char* bus_name, int32_t* out_voltage_mv)
{
  ESP_RETURN_ON_FALSE(manager && bus_name && out_voltage_mv,
                      ESP_ERR_INVALID_ARG,
                      s_tag,
                      "Manager, bus_name, or out_voltage_mv is NULL");

  /* Dispatch to ADC bus function */
  return star_bus_adc_read_voltage(manager, bus_name, out_voltage_mv);
}
